{
    "countries": [
        {
            "name": "Clodolândia",
            "flag": "🏴‍☠️",
            "events": [
                {
                    "asset": "/localEvents/clodolandia/criseImovel.png",
                    "name": "Crise no Setor Imobiliário",
                    "conditions": [
                        {
                            "variable": "investimentoPrivado",
                            "operator": "<",
                            "value": 40
                        }
                    ],
                    "description": "Uma bolha especulativa no mercado imobiliário de Clodolândia finalmente estourou, levando os preços dos imóveis ao colapso. Construtoras enfrentam dificuldades financeiras severas, bancos acumulam perdas com empréstimos inadimplentes, e o setor da construção civil está praticamente paralisado. O efeito se espalha pela economia através da redução do crédito e da confiança empresarial.",
                    "impacts": {
                        "consumoFamiliar": -20,
                        "investimentoPrivado": -35,
                        "demandaMoeda": -5
                    },
                    "options": {
                        "banco": [
                            {
                                "id": "b1",
                                "description": "Reduzir taxa de juros para estimular crédito"
                            },
                            {
                                "id": "b2",
                                "description": "Expandir a base monetária para injetar liquidez"
                            }
                        ],
                        "governo": [
                            {
                                "id": "g1",
                                "description": "Aumentar gastos públicos em infraestrutura"
                            },
                            {
                                "id": "g2",
                                "description": "Oferecer subsídios ao setor da construção civil"
                            }
                        ]
                    },
                    "outcomes": [
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.4,
                            "impact": {
                                "taxaDeJuros": -0.25,
                                "gastosPublicos": 20,
                                "investimentoPrivado": -5,
                                "consumoFamiliar": -8,
                                "score_factor": 0.7
                            },
                            "resultText": "Apesar dos estímulos, a crise imobiliária deixou cicatrizes profundas. O investimento privado permaneceu retraído devido à desconfiança no setor, e o consumo sofreu com o efeito riqueza negativo da queda dos preços imobiliários."
                        },
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.6,
                            "impact": {
                                "taxaDeJuros": -0.25,
                                "gastosPublicos": 20,
                                "consumoFamiliar": -12,
                                "investimentoPrivado": -8,
                                "nivelPrecos": -0.15,
                                "score_factor": 0.7
                            },
                            "resultText": "A profunda crise imobiliária mostrou-se resistente aos estímulos. O investimento privado colapsou devido à desconfiança, o consumo despencou e uma deflação preocupante sinalizou uma recessão severa."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.5,
                            "impact": {
                                "ofertaMoeda": 25,
                                "investimentoPrivado": 20,
                                "consumoFamiliar": 8,
                                "gastosPublicos": 12,
                                "score_factor": 1.025
                            },
                            "resultText": "A injeção de liquidez pelo Banco Central, combinada com subsídios diretos ao vital setor da construção civil, conseguiu estancar a sangria. Construtoras retomaram projetos e o investimento no setor mostrou sinais de vida, puxando consigo um modesto, mas bem-vindo, aumento no consumo familiar."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.5,
                            "impact": {
                                "ofertaMoeda": 25,
                                "gastosPublicos": 12,
                                "nivelPrecos": 0.35,
                                "investimentoPrivado": -5,
                                "score_factor": 1.025
                            },
                            "resultText": "A tentativa de reanimar a economia foi percebida como desesperada e mal calibrada. O excesso de moeda injetada sem um correspondente aumento na confiança ou na produção real apenas alimentou a inflação. O setor da construção, apesar dos subsídios, permaneceu cético, e a população viu seu poder de compra corroído."
                        },
                        {
                            "combo": [
                                "b1",
                                "g2"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "taxaDeJuros": -0.15,
                                "investimentoPrivado": 10,
                                "gastosPublicos": 12,
                                "consumoFamiliar": 2,
                                "nivelPrecos": 0.05,
                                "score_factor": 0.95
                            },
                            "resultText": "As políticas, embora bem-intencionadas, pareceram descoordenadas. A redução de juros incentivou algum investimento, e os subsídios deram um alívio temporário à construção, mas o impacto geral foi modesto. A economia mostrou uma leve melhora, mas sem o vigor necessário para uma recuperação plena, com uma pequena pressão inflacionária começando a surgir."
                        },
                        {
                            "combo": [
                                "b2",
                                "g1"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "gastosPublicos": 20,
                                "ofertaMoeda": 20,
                                "nivelPrecos": 0.4,
                                "consumoFamiliar": -8,
                                "investimentoPrivado": 0,
                                "score_factor": 1.0
                            },
                            "resultText": "A combinação agressiva de expansão monetária e grandes obras públicas, sem a devida cautela, superaqueceu perigosamente a economia. A inflação disparou, corroendo o poder de compra das famílias e gerando incerteza. O investimento privado estagnou, temendo a instabilidade, e o tiro saiu pela culatra."
                        }
                    ]
                },
                {
                    "asset": "/localEvents/clodolandia/fornecimentoLocal.png",
                    "name": "Ruptura no Fornecimento Local",
                    "conditions": [],
                    "description": "A falência inesperada de um grande fornecedor regional de insumos industriais causou uma ruptura nas cadeias de suprimento de Clodolândia. Empresas de diversos setores enfrentam escassez de materiais essenciais, levando ao aumento dos custos de produção e dos preços finais. A situação ameaça a estabilidade do mercado interno e a competitividade da indústria local.",
                    "impacts": {
                        "nivelPrecos": 0.15,
                        "consumoFamiliar": -10,
                        "investimentoPrivado": -5
                    },
                    "options": {
                        "banco": [
                            {
                                "id": "b1",
                                "description": "Aumentar taxa de juros para conter a inflação local"
                            },
                            {
                                "id": "b2",
                                "description": "Reduzir a oferta de moeda para controlar a pressão nos preços"
                            }
                        ],
                        "governo": [
                            {
                                "id": "g1",
                                "description": "Subsidiar distribuição de produtos essenciais para a população"
                            },
                            {
                                "id": "g2",
                                "description": "Incentivar pequenos produtores locais para substituir o fornecedor perdido"
                            }
                        ]
                    },
                    "outcomes": [
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.7,
                            "impact": {
                                "taxaDeJuros": 0.2,
                                "gastosPublicos": 15,
                                "nivelPrecos": -0.05,
                                "consumoFamiliar": -2,
                                "investimentoPrivado": -5,
                                "score_factor": 0.9
                            },
                            "resultText": "A ação coordenada do Banco Central e Governo conseguiu estabilizar parcialmente os preços, mas os juros altos e a incerteza na cadeia de suprimentos prejudicaram o consumo e o investimento. A economia se manteve estável, mas com crescimento reduzido."
                        },
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.3,
                            "impact": {
                                "taxaDeJuros": 0.2,
                                "gastosPublicos": 15,
                                "consumoFamiliar": -5,
                                "investimentoPrivado": -12,
                                "nivelPrecos": -0.05,
                                "score_factor": 0.9
                            },
                            "resultText": "O remédio para conter a inflação de custos revelou-se amargo. Embora os preços tenham cedido um pouco, a alta dos juros e o clima de incerteza sufocaram o consumo e o investimento, empurrando a economia para uma desaceleração preocupante."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.6,
                            "impact": {
                                "ofertaMoeda": -10,
                                "investimentoPrivado": 5,
                                "nivelPrecos": -0.08,
                                "gastosPublicos": 8,
                                "consumoFamiliar": -3,
                                "score_factor": 0.95
                            },
                            "resultText": "A política de contração monetária controlada, aliada ao fomento de novos produtores locais, começou a surtir efeito, mas ainda há pressões contracionárias devido à ruptura na cadeia de suprimentos. A recuperação será gradual."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.4,
                            "impact": {
                                "ofertaMoeda": -10,
                                "gastosPublicos": 5,
                                "investimentoPrivado": -3,
                                "consumoFamiliar": -5,
                                "nivelPrecos": 0.05,
                                "score_factor": 0.9
                            },
                            "resultText": "As medidas mostraram-se lentas para gerar resultados concretos. A redução da oferta monetária não foi suficiente para frear a alta de preços de imediato, e os incentivos aos produtores locais demoraram a se traduzir em aumento da oferta. O consumo caiu enquanto a população esperava pela normalização."
                        },
                        {
                            "combo": [
                                "b1",
                                "g2"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "taxaDeJuros": 0.2,
                                "investimentoPrivado": -10,
                                "gastosPublicos": 10,
                                "nivelPrecos": 0,
                                "score_factor": 0.95
                            },
                            "resultText": "As políticas tiveram efeitos conflitantes. O aumento de juros conseguiu segurar a inflação, mas, ao mesmo tempo, desencorajou o investimento necessário para que os novos produtores locais pudessem expandir rapidamente. O resultado foi uma estabilidade precária com baixo crescimento."
                        },
                        {
                            "combo": [
                                "b2",
                                "g1"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "ofertaMoeda": 15,
                                "gastosPublicos": 10,
                                "nivelPrecos": 0.15,
                                "investimentoPrivado": -5,
                                "score_factor": 0.85
                            },
                            "resultText": "As políticas pareceram desalinhadas e arriscadas. Enquanto os incentivos fiscais tentavam atrair capital, o uso de reservas para segurar o câmbio sem um forte pilar de confiança apenas adiou o problema, gerando inflação e não revertendo a fuga de investimentos de forma sustentável."
                        }
                    ]
                },
                {
                    "asset": "/localEvents/clodolandia/fugaCapital.png",
                    "name": "Fuga de Capitais",
                    "conditions": [],
                    "description": "Investidores estrangeiros perderam confiança na economia de Clodolândia devido a incertezas políticas internas e questionamentos sobre a sustentabilidade das políticas econômicas locais. O resultado é uma acelerada retirada de capitais do país, pressionando a moeda nacional e reduzindo a disponibilidade de financiamento para empresas e projetos de investimento.",
                    "impacts": {
                        "investimentoPrivado": -25
                    },
                    "options": {
                        "banco": [
                            {
                                "id": "b1",
                                "description": "Aumentar taxa de juros para conter fuga de capitais"
                            },
                            {
                                "id": "b2",
                                "description": "Utilizar reservas cambiais para estabilizar a economia"
                            }
                        ],
                        "governo": [
                            {
                                "id": "g1",
                                "description": "Implementar incentivos fiscais para atrair capital externo"
                            },
                            {
                                "id": "g2",
                                "description": "Negociar acordos internacionais de confiança e comércio"
                            }
                        ]
                    },
                    "outcomes": [
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.4,
                            "impact": {
                                "taxaDeJuros": 0.5,
                                "gastosPublicos": 8,
                                "investimentoPrivado": -5,
                                "consumoFamiliar": -3,
                                "score_factor": 0.85
                            },
                            "resultText": "A elevação drástica dos juros, combinada com incentivos fiscais, conseguiu reduzir a saída de capitais, mas a um alto custo interno. O crédito encareceu, afetando investimentos e consumo."
                        },
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.6,
                            "impact": {
                                "taxaDeJuros": 0.5,
                                "gastosPublicos": 8,
                                "investimentoPrivado": -15,
                                "consumoFamiliar": -10,
                                "sensibilidadeInvestimentoAoJuros_factor": 1.1,
                                "score_factor": 0.85
                            },
                            "resultText": "As medidas não conseguiram conter a fuga de capitais. Os juros altos aprofundaram a recessão, derrubando consumo e investimento, criando um ciclo vicioso de desconfiança."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.3,
                            "impact": {
                                "investimentoPrivado": -8,
                                "consumoFamiliar": -5,
                                "score_factor": 0.8
                            },
                            "resultText": "A intervenção cambial ofereceu estabilidade temporária, mas os acordos internacionais demoraram para se materializar. A economia ainda sofre com a desconfiança dos investidores."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.7,
                            "impact": {
                                "investimentoPrivado": -12,
                                "consumoFamiliar": -8,
                                "gastosPublicos": -3,
                                "score_factor": 0.7
                            },
                            "resultText": "A queima de reservas cambiais mostrou-se um esforço fútil contra a maré de desconfiança global. Os acordos internacionais, embora bem-vindos, não foram suficientes para reverter o pessimismo no curto prazo, e o país ficou mais vulnerável."
                        },
                        {
                            "combo": [
                                "b1",
                                "g2"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "taxaDeJuros": 0.4,
                                "investimentoPrivado": 5,
                                "consumoFamiliar": -5,
                                "score_factor": 0.95
                            },
                            "resultText": "A combinação de juros mais altos e diplomacia econômica trouxe resultados mistos. A confiança externa melhorou marginalmente, estabilizando a moeda, mas os juros elevados continuaram a frear a atividade econômica doméstica, resultando em estagnação."
                        },
                        {
                            "combo": [
                                "b2",
                                "g1"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "gastosPublicos": -5,
                                "investimentoPrivado": -10,
                                "consumoFamiliar": -7,
                                "score_factor": 0.7
                            },
                            "resultText": "As reservas cambiais foram rapidamente esgotadas sem conseguir conter a fuga. Os incentivos fiscais, sem um ambiente de confiança, apenas agravaram a situação fiscal, levando a economia a uma crise ainda mais profunda."
                        }
                    ]
                },
                {
                    "asset": "/localEvents/clodolandia/boomTecnologico.png",
                    "name": "Boom Tecnológico",
                    "conditions": [],
                    "description": "O setor de tecnologia de Clodolândia está experimentando um crescimento explosivo impulsionado por inovações locais e maior adoção digital pela população e empresas. Startups florescem, grandes corporações expandem suas operações tecnológicas e a produtividade em diversos setores aumenta significativamente. O otimismo sobre o futuro digital do país é contagiante.",
                    "impacts": {
                        "investimentoPrivado": 25,
                        "consumoFamiliar": 15
                    },
                    "options": {
                        "banco": [
                            {
                                "id": "b1",
                                "description": "Reduzir taxa de juros para acelerar o crescimento"
                            },
                            {
                                "id": "b2",
                                "description": "Manter estabilidade monetária para evitar bolhas"
                            }
                        ],
                        "governo": [
                            {
                                "id": "g1",
                                "description": "Investir em educação para sustentar o crescimento"
                            },
                            {
                                "id": "g2",
                                "description": "Reduzir impostos para o setor de tecnologia"
                            }
                        ]
                    },
                    "outcomes": [
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.7,
                            "impact": {
                                "taxaDeJuros": -0.15,
                                "gastosPublicos": 15,
                                "consumoFamiliar": 12,
                                "investimentoPrivado": 22,
                                "sensibilidadeInvestimentoAoJuros_factor": 1.2,
                                "sensibilidadeDaMoedaARenda_factor": 1.1,
                                "score_factor": 1.125
                            },
                            "resultText": "A combinação visionária de estímulo monetário e investimento estratégico em capital humano provou ser um sucesso. O crescimento acelerou de forma sustentável, com mão de obra qualificada absorvendo as novas tecnologias e expandindo ainda mais o potencial produtivo do país."
                        },
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.3,
                            "impact": {
                                "taxaDeJuros": -0.15,
                                "gastosPublicos": 15,
                                "nivelPrecos": 0.2,
                                "demandaMoeda": 8,
                                "score_factor": 1.125
                            },
                            "resultText": "O crescimento foi robusto, mas a política monetária excessivamente frouxa, mesmo com investimentos em educação, começou a gerar pressões inflacionárias. A demanda agregada superaqueceu a capacidade produtiva no curto prazo, exigindo cautela futura."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.6,
                            "impact": {
                                "investimentoPrivado": 10,
                                "gastosPublicos": -10,
                                "score_factor": 1.05
                            },
                            "resultText": "A política de estabilidade monetária do Banco Central evitou a formação de bolhas, enquanto os incentivos fiscais direcionados impulsionaram ainda mais o setor tecnológico. O crescimento foi sólido e concentrado, fortalecendo a base inovadora da economia."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.4,
                            "impact": {
                                "nivelPrecos": 0.3,
                                "investimentoPrivado": 5,
                                "consumoFamiliar": -5,
                                "score_factor": 1.05
                            },
                            "resultText": "O excesso de estímulo e a desregulamentação rápida criaram uma bolha tecnológica perigosa. Os preços dispararam devido ao superaquecimento, e quando a bolha estourou, muitos investimentos se mostraram especulativos, prejudicando o consumo."
                        },
                        {
                            "combo": [
                                "b1",
                                "g2"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "taxaDeJuros": -0.1,
                                "gastosPublicos": -8,
                                "investimentoPrivado": 18,
                                "nivelPrecos": 0.15,
                                "score_factor": 1.0
                            },
                            "resultText": "O crédito barato e os cortes de impostos para o setor tecnológico criaram um ambiente de euforia. O setor disparou, puxando o crescimento, mas sinais preocupantes de superaquecimento e formação de uma bolha especulativa começaram a surgir, exigindo monitoramento constante."
                        },
                        {
                            "combo": [
                                "b2",
                                "g1"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "gastosPublicos": 12,
                                "investimentoPrivado": 8,
                                "score_factor": 1.15
                            },
                            "resultText": "A estratégia de fortalecer a base educacional enquanto o Banco Central mantinha a estabilidade monetária promoveu um crescimento mais gradual, porém sólido e sustentável. A economia absorveu bem os ganhos tecnológicos, preparando-se para um futuro promissor sem sobressaltos."
                        }
                    ]
                },
                {
                    "asset": "/localEvents/clodolandia/confiancaConsumidor.png",
                    "name": "Confiança do Consumidor em Alta",
                    "conditions": [],
                    "description": "Os consumidores de Clodolândia estão demonstrando um otimismo renovado em relação às suas perspectivas econômicas pessoais e ao futuro do país. Pesquisas indicam maior disposição para realizar compras de bens duráveis e as empresas relatam aumento na demanda por seus produtos e serviços. O ambiente de negócios se beneficia deste ciclo positivo de confiança.",
                    "impacts": {
                        "consumoFamiliar": 20,
                        "investimentoPrivado": 15
                    },
                    "options": {
                        "banco": [
                            {
                                "id": "b1",
                                "description": "Aumentar levemente a taxa de juros para evitar superaquecimento"
                            },
                            {
                                "id": "b2",
                                "description": "Aproveitar o momento para manter liquidez elevada"
                            }
                        ],
                        "governo": [
                            {
                                "id": "g1",
                                "description": "Aproveitar o momento para consolidar finanças públicas"
                            },
                            {
                                "id": "g2",
                                "description": "Expandir programas sociais para ampliar o bem-estar"
                            }
                        ]
                    },
                    "outcomes": [
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.7,
                            "impact": {
                                "taxaDeJuros": 0.1,
                                "gastosPublicos": -10,
                                "consumoFamiliar": 5,
                                "investimentoPrivado": 3,
                                "score_factor": 1.05
                            },
                            "resultText": "A abordagem prudente de leve aperto monetário e consolidação fiscal, em um momento de otimismo, fortaleceu os fundamentos da economia. A confiança se manteve elevada, a dívida pública caiu, e o crescimento continuou de forma mais sustentável, aumentando a resiliência de Clodolândia."
                        },
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.3,
                            "impact": {
                                "taxaDeJuros": 0.1,
                                "gastosPublicos": -10,
                                "investimentoPrivado": -8,
                                "consumoFamiliar": -3,
                                "score_factor": 1.05
                            },
                            "resultText": "O ajuste fiscal e monetário rompeu o ciclo de otimismo excessivo, revelando que parte da confiança estava baseada em expectativas irreais. O mercado corrigiu para baixo, investimentos especulativos perderam valor, e o consumo recuou."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.6,
                            "impact": {
                                "ofertaMoeda": 10,
                                "consumoFamiliar": 15,
                                "gastosPublicos": 12,
                                "score_factor": 1.15
                            },
                            "resultText": "A política de manter a torneira da liquidez aberta, combinada com a expansão de programas sociais, capitalizou o otimismo existente. O padrão de vida da população melhorou, o consumo disparou, e a popularidade do governo atingiu níveis recordes, com forte crescimento econômico."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.4,
                            "impact": {
                                "ofertaMoeda": 10,
                                "gastosPublicos": 12,
                                "nivelPrecos": 0.25,
                                "demandaMoeda": 8,
                                "score_factor": 1.15
                            },
                            "resultText": "O excesso de estímulo, tanto monetário quanto fiscal, começou a gerar preocupações inflacionárias. Embora o bem-estar social tenha aumentado no curto prazo, a sustentabilidade dessa política foi questionada, e o mercado começou a precificar riscos de superaquecimento."
                        },
                        {
                            "combo": [
                                "b1",
                                "g2"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "taxaDeJuros": 0.1,
                                "gastosPublicos": 12,
                                "consumoFamiliar": 8,
                                "nivelPrecos": 0.1,
                                "score_factor": 1.0
                            },
                            "resultText": "As políticas tiveram efeitos parcialmente contraditórios. O leve aumento de juros tentou conter pressões inflacionárias, enquanto a expansão dos programas sociais impulsionou o consumo. O crescimento foi moderado, mas com tensões entre os objetivos de controle de preços e bem-estar social."
                        },
                        {
                            "combo": [
                                "b2",
                                "g1"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "gastosPublicos": -10,
                                "ofertaMoeda": 8,
                                "demandaMoeda": 3,
                                "consumoFamiliar": 5,
                                "score_factor": 1.1
                            },
                            "resultText": "A economia permaneceu estável, com a consolidação fiscal sendo parcialmente compensada pela liquidez. No entanto, alguns analistas sentiram que, com o otimismo global, uma postura fiscal menos contracionista poderia ter gerado ganhos de crescimento e bem-estar ainda maiores."
                        }
                    ]
                }
            ]
        },
        {
            "name": "Jundiaí",
            "flag": "🇧🇷",
            "events": [
                {
                    "asset": "/localEvents/jundiai/escandaloPolitico.png",
                    "name": "Escândalo Político de Grande Proporção",
                    "conditions": [],
                    "description": "Um escândalo de corrupção envolvendo figuras políticas e empresariais de destaque em Jundiaí foi descoberto pela imprensa e autoridades. As revelações incluem desvio de recursos públicos, contratos superfaturados e esquemas de propina que se estenderam por anos. A confiança nas instituições está severamente abalada e a instabilidade política ameaça o ambiente de negócios.",
                    "impacts": {
                        "investimentoPrivado": -25,
                        "consumoFamiliar": -15
                    },
                    "options": {
                        "banco": [
                            {
                                "id": "b1",
                                "description": "Aumentar a taxa de juros para sinalizar compromisso com a estabilidade."
                            },
                            {
                                "id": "b2",
                                "description": "Injetar liquidez para acalmar os mercados financeiros."
                            }
                        ],
                        "governo": [
                            {
                                "id": "g1",
                                "description": "Promover uma reforma anticorrupção profunda e transparente."
                            },
                            {
                                "id": "g2",
                                "description": "Anunciar um pacote de estímulo fiscal para reaquecer a economia."
                            }
                        ]
                    },
                    "outcomes": [
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.3,
                            "impact": {
                                "taxaDeJuros": 0.3,
                                "investimentoPrivado": -8,
                                "consumoFamiliar": -5,
                                "gastosPublicos": -3,
                                "score_factor": 0.7
                            },
                            "resultText": "Apesar das reformas anticorrupção, a desconfiança persistiu e o aperto monetário agravou a recessão. A economia ainda sofre com os efeitos do escândalo."
                        },
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.7,
                            "impact": {
                                "taxaDeJuros": 0.3,
                                "investimentoPrivado": -12,
                                "consumoFamiliar": -8,
                                "gastosPublicos": -5,
                                "score_factor": 0.7
                            },
                            "resultText": "A reforma anticorrupção foi vista como insuficiente e o aumento de juros aprofundou a recessão. A desconfiança persistiu, causando fuga de capitais e forte retração econômica."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.2,
                            "impact": {
                                "ofertaMoeda": 15,
                                "gastosPublicos": -10,
                                "investimentoPrivado": -8,
                                "nivelPrecos": 0.25,
                                "consumoFamiliar": -5,
                                "score_factor": 0.75
                            },
                            "resultText": "A tentativa de estímulo econômico foi vista como desperdício de recursos públicos em meio ao escândalo. A inflação disparou, a confiança despencou e a economia entrou em recessão profunda."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.8,
                            "impact": {
                                "ofertaMoeda": 15,
                                "gastosPublicos": -15,
                                "investimentoPrivado": -15,
                                "nivelPrecos": 0.4,
                                "consumoFamiliar": -12,
                                "score_factor": 0.75
                            },
                            "resultText": "As medidas foram vistas como uma tentativa desesperada de encobrir o escândalo. A liquidez excessiva gerou inflação descontrolada e a crise de confiança se aprofundou, levando a economia ao colapso."
                        },
                        {
                            "combo": [
                                "b1",
                                "g2"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "taxaDeJuros": 0.3,
                                "gastosPublicos": 20,
                                "investimentoPrivado": -8,
                                "nivelPrecos": 0.1,
                                "consumoFamiliar": -5,
                                "score_factor": 0.75
                            },
                            "resultText": "As políticas conflitantes geraram confusão. O aumento de juros contraiu a economia, enquanto o estímulo fiscal tentava reanimá-la sem resolver a crise de confiança fundamental, resultando em estagnação com inflação."
                        },
                        {
                            "combo": [
                                "b2",
                                "g1"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "ofertaMoeda": 15,
                                "investimentoPrivado": 3,
                                "nivelPrecos": 0.15,
                                "consumoFamiliar": 1,
                                "score_factor": 0.95
                            },
                            "resultText": "A reforma anticorrupção começou a surtir efeito na confiança, mas a injeção de liquidez gerou alguma pressão inflacionária. A economia mostrou sinais tímidos de melhora, mas a instabilidade monetária tornou-se uma preocupação."
                        }
                    ]
                },
                {
                    "asset": "/localEvents/jundiai/acordoRegional.png",
                    "name": "Novo Acordo Comercial Regional",
                    "conditions": [],
                    "description": "Jundiaí firmou um ambicioso acordo comercial bilateral com países vizinhos, reduzindo tarifas e facilitando o intercâmbio de bens e serviços. O acordo promete abrir novos mercados para exportadores locais e facilitar o acesso a insumos importados a preços mais competitivos. O setor empresarial demonstra grande expectativa com as novas oportunidades de negócios.",
                    "impacts": {
                        "investimentoPrivado": 10,
                        "consumoFamiliar": 5
                    },
                    "options": {
                        "banco": [
                            {
                                "id": "b1",
                                "description": "Manter a taxa de câmbio competitiva para maximizar ganhos com exportação."
                            },
                            {
                                "id": "b2",
                                "description": "Reduzir a taxa de juros para estimular o investimento produtivo."
                            }
                        ],
                        "governo": [
                            {
                                "id": "g1",
                                "description": "Investir em infraestrutura logística para suportar o aumento do comércio."
                            },
                            {
                                "id": "g2",
                                "description": "Criar linhas de crédito subsidiadas para exportadores."
                            }
                        ]
                    },
                    "outcomes": [
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.7,
                            "impact": {
                                "gastosPublicos": 15,
                                "investimentoPrivado": 18,
                                "consumoFamiliar": 8,
                                "score_factor": 1.1
                            },
                            "resultText": "A política cambial favorável e os investimentos em infraestrutura criaram um ciclo virtuoso. As exportações dispararam, atraindo investimentos e impulsionando um forte crescimento econômico."
                        },
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.3,
                            "impact": {
                                "gastosPublicos": 15,
                                "nivelPrecos": 0.1,
                                "consumoFamiliar": 3,
                                "score_factor": 1.1
                            },
                            "resultText": "Os investimentos em infraestrutura demoraram a maturar e a desvalorização cambial gerou alguma inflação importada. Os ganhos com o acordo foram mais modestos do que o esperado inicialmente."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.6,
                            "impact": {
                                "taxaDeJuros": -0.2,
                                "gastosPublicos": 10,
                                "investimentoPrivado": 20,
                                "consumoFamiliar": 8,
                                "score_factor": 1.0499999999999998
                            },
                            "resultText": "O crédito farto e barato, tanto do BC quanto do governo, turbinou o investimento e a capacidade exportadora. Jundiaí aproveitou ao máximo o novo acordo comercial."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.4,
                            "impact": {
                                "taxaDeJuros": -0.2,
                                "gastosPublicos": 10,
                                "investimentoPrivado": 8,
                                "nivelPrecos": 0.15,
                                "consumoFamiliar": 3,
                                "score_factor": 1.0499999999999998
                            },
                            "resultText": "O estímulo ao crédito foi excessivo, gerando endividamento e pressões inflacionárias. Embora as exportações tenham crescido, a qualidade do crescimento foi questionada."
                        },
                        {
                            "combo": [
                                "b1",
                                "g2"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "gastosPublicos": 10,
                                "investimentoPrivado": 15,
                                "consumoFamiliar": 6,
                                "score_factor": 1.1
                            },
                            "resultText": "A combinação de câmbio competitivo e apoio direto aos exportadores foi eficaz. As vendas externas aumentaram significativamente, beneficiando a economia como um todo."
                        },
                        {
                            "combo": [
                                "b2",
                                "g1"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "taxaDeJuros": -0.2,
                                "gastosPublicos": 15,
                                "investimentoPrivado": 22,
                                "consumoFamiliar": 4.2,
                                "score_factor": 1.15
                            },
                            "resultText": "A redução de juros e o investimento em infraestrutura prepararam o terreno para um crescimento sólido e sustentado, aproveitando as novas oportunidades comerciais."
                        }
                    ]
                },
                {
                    "asset": "/localEvents/jundiai/greveGeral.png",
                    "name": "Greve Geral de Setores Chave",
                    "conditions": [],
                    "description": "Trabalhadores de setores essenciais como transporte, energia e serviços públicos iniciaram uma greve geral para protestar contra políticas salariais e condições de trabalho em Jundiaí. A paralisação afeta significativamente a atividade econômica, com interrupções na produção industrial, no fornecimento de energia e nos serviços de transporte público. A tensão social está em alta.",
                    "impacts": {
                        "consumoFamiliar": -15,
                        "investimentoPrivado": -10,
                        "nivelPrecos": 0.1,
                        "gastosPublicos": -5
                    },
                    "options": {
                        "banco": [
                            {
                                "id": "b1",
                                "description": "Manter política monetária restritiva para controlar a inflação gerada pela escassez."
                            },
                            {
                                "id": "b2",
                                "description": "Sinalizar flexibilidade monetária para facilitar a negociação e o fim da greve."
                            }
                        ],
                        "governo": [
                            {
                                "id": "g1",
                                "description": "Negociar com os grevistas e ceder a algumas reivindicações salariais."
                            },
                            {
                                "id": "g2",
                                "description": "Adotar uma postura firme e buscar medidas legais para encerrar a paralisação."
                            }
                        ]
                    },
                    "outcomes": [
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.6,
                            "impact": {
                                "taxaDeJuros": 0.1,
                                "gastosPublicos": 10,
                                "consumoFamiliar": 5,
                                "nivelPrecos": -0.05,
                                "investimentoPrivado": 1,
                                "score_factor": 1.025
                            },
                            "resultText": "A negociação bem-sucedida, apoiada por uma política monetária que controlou a inflação da crise, permitiu o fim da greve. A produção foi retomada e a confiança começou a se restabelecer, embora com custos fiscais."
                        },
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.4,
                            "impact": {
                                "taxaDeJuros": 0.1,
                                "gastosPublicos": 10,
                                "consumoFamiliar": -5,
                                "investimentoPrivado": -2,
                                "score_factor": 1.025
                            },
                            "resultText": "As concessões salariais foram insuficientes para acalmar os ânimos completamente, e a política monetária restritiva dificultou a recuperação. A greve deixou sequelas na produção e no consumo."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.3,
                            "impact": {
                                "ofertaMoeda": 5,
                                "consumoFamiliar": -3,
                                "investimentoPrivado": -2,
                                "gastosPublicos": -2,
                                "score_factor": 0.75
                            },
                            "resultText": "A postura inflexível do governo e a sinalização monetária dúbia agravaram a crise. A greve se prolongou, causando danos severos à economia e à imagem do país."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.7,
                            "impact": {
                                "ofertaMoeda": 5,
                                "consumoFamiliar": -10,
                                "investimentoPrivado": -3,
                                "score_factor": 0.75
                            },
                            "resultText": "A greve terminou após desgaste e medidas legais, mas a um custo social e econômico alto. A flexibilidade monetária não foi suficiente para compensar a intransigência nas negociações, e a recuperação foi lenta e dolorosa."
                        },
                        {
                            "combo": [
                                "b1",
                                "g2"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "taxaDeJuros": 0.1,
                                "consumoFamiliar": -3,
                                "investimentoPrivado": -2,
                                "gastosPublicos": -1,
                                "score_factor": 0.75
                            },
                            "resultText": "A combinação de repressão à greve com aperto monetário aprofundou a crise. A produção demorou a normalizar, a confiança despencou e a economia mergulhou em recessão."
                        },
                        {
                            "combo": [
                                "b2",
                                "g1"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "ofertaMoeda": 5,
                                "gastosPublicos": -8,
                                "consumoFamiliar": -5,
                                "investimentoPrivado": -8,
                                "nivelPrecos": 0.15,
                                "score_factor": 0.7
                            },
                            "resultText": "As negociações se prolongaram demais, a flexibilização monetária gerou inflação e os custos da greve superaram os benefícios dos acordos. A economia ficou mais frágil e com menos recursos públicos."
                        }
                    ]
                },
                {
                    "asset": "/localEvents/jundiai/inovacaoSetor.png",
                    "name": "Inovação Disruptiva no Setor de Serviços",
                    "conditions": [],
                    "description": "Uma empresa local desenvolveu uma plataforma tecnológica inovadora que está revolucionando a prestação de serviços em Jundiaí, aumentando significativamente a eficiência operacional e criando novos modelos de negócios. O sucesso da iniciativa está atraindo investimentos para o setor de tecnologia e inspirando outras empresas a adotarem soluções digitais inovadoras.",
                    "impacts": {
                        "investimentoPrivado": 18,
                        "consumoFamiliar": 4.5
                    },
                    "options": {
                        "banco": [
                            {
                                "id": "b1",
                                "description": "Manter a estabilidade dos preços para fomentar um crescimento saudável."
                            },
                            {
                                "id": "b2",
                                "description": "Reduzir juros para impulsionar a expansão das novas empresas."
                            }
                        ],
                        "governo": [
                            {
                                "id": "g1",
                                "description": "Investir em educação e qualificação para o novo mercado de trabalho."
                            },
                            {
                                "id": "g2",
                                "description": "Criar um marco regulatório favorável à inovação e às startups."
                            }
                        ]
                    },
                    "outcomes": [
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.7,
                            "impact": {
                                "gastosPublicos": 15,
                                "investimentoPrivado": 22,
                                "consumoFamiliar": 5.5,
                                "score_factor": 1.175
                            },
                            "resultText": "A política de estabilidade monetária e o investimento em capital humano criaram um ambiente ideal para a inovação florescer de forma sustentável. O setor de serviços modernizou-se, impulsionando toda a economia."
                        },
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.3,
                            "impact": {
                                "gastosPublicos": 15,
                                "investimentoPrivado": 15,
                                "consumoFamiliar": 3.5,
                                "score_factor": 1.175
                            },
                            "resultText": "Os investimentos em educação demoraram a surtir efeito e a política monetária neutra não foi suficiente para acelerar a difusão da inovação. O crescimento foi positivo, mas abaixo do potencial máximo."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.6,
                            "impact": {
                                "taxaDeJuros": -0.25,
                                "investimentoPrivado": 28,
                                "consumoFamiliar": 6,
                                "score_factor": 1.05
                            },
                            "resultText": "O crédito facilitado e um ambiente regulatório amigável transformaram Jundiaí num verdadeiro hub de inovação. Novas empresas surgiram em profusão, e o setor de serviços experimentou um boom."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.4,
                            "impact": {
                                "taxaDeJuros": -0.25,
                                "investimentoPrivado": 15,
                                "nivelPrecos": 0.15,
                                "consumoFamiliar": 4,
                                "score_factor": 1.05
                            },
                            "resultText": "O excesso de estímulo e a desregulamentação rápida geraram um crescimento acelerado, mas com sinais de uma possível bolha no setor de tecnologia e pressões inflacionárias."
                        },
                        {
                            "combo": [
                                "b1",
                                "g2"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "investimentoPrivado": 25,
                                "consumoFamiliar": 5,
                                "score_factor": 1.2
                            },
                            "resultText": "O marco regulatório favorável impulsionou a inovação, enquanto a estabilidade monetária garantiu que o crescimento fosse sólido e sem desequilíbrios inflacionários."
                        },
                        {
                            "combo": [
                                "b2",
                                "g1"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "taxaDeJuros": -0.2,
                                "gastosPublicos": 15,
                                "investimentoPrivado": 20,
                                "consumoFamiliar": 4.8,
                                "score_factor": 1.2
                            },
                            "resultText": "A combinação de investimento em qualificação com juros baixos permitiu que a mão de obra absorvesse as novas tecnologias, resultando em ganhos de produtividade e crescimento robusto."
                        }
                    ]
                },
                {
                    "asset": "/localEvents/jundiai/quebraSafra.png",
                    "name": "Quebra de Safra Agrícola Significativa",
                    "conditions": [],
                    "description": "Uma combinação de condições climáticas desfavoráveis e problemas na cadeia de suprimentos agrícolas resultou em uma significativa redução na produção de alimentos em Jundiaí. A oferta de produtos básicos diminuiu drasticamente, elevando os preços no mercado interno e impactando negativamente a renda dos produtores rurais e o orçamento das famílias.",
                    "impacts": {
                        "consumoFamiliar": -10,
                        "investimentoPrivado": -3.5,
                        "nivelPrecos": 0.1
                    },
                    "options": {
                        "banco": [
                            {
                                "id": "b1",
                                "description": "Aumentar a taxa de juros para combater a inflação de alimentos."
                            },
                            {
                                "id": "b2",
                                "description": "Manter a política monetária para não prejudicar outros setores."
                            }
                        ],
                        "governo": [
                            {
                                "id": "g1",
                                "description": "Conceder auxílio emergencial e crédito subsidiado aos produtores afetados."
                            },
                            {
                                "id": "g2",
                                "description": "Importar alimentos para estabilizar os preços internos."
                            }
                        ]
                    },
                    "outcomes": [
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.5,
                            "impact": {
                                "taxaDeJuros": 0.2,
                                "gastosPublicos": 18,
                                "consumoFamiliar": -1,
                                "nivelPrecos": -0.05,
                                "score_factor": 0.95
                            },
                            "resultText": "O auxílio aos produtores ajudou a mitigar as perdas e o aperto monetário controlou a inflação. A recuperação do setor foi iniciada, mas a economia ainda sentiu o impacto negativo."
                        },
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.5,
                            "impact": {
                                "taxaDeJuros": 0.2,
                                "gastosPublicos": 18,
                                "consumoFamiliar": -19,
                                "investimentoPrivado": -10,
                                "score_factor": 0.95
                            },
                            "resultText": "O aumento de juros em meio à crise agrícola aprofundou a recessão. O auxílio governamental foi insuficiente para compensar a queda na renda e no consumo."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.7,
                            "impact": {
                                "consumoFamiliar": 5,
                                "investimentoPrivado": -0.5,
                                "nivelPrecos": -0.1,
                                "score_factor": 1.1
                            },
                            "resultText": "A importação de alimentos estabilizou os preços e garantiu o abastecimento, aliviando a pressão sobre os consumidores. A política monetária neutra evitou maiores danos a outros setores."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.3,
                            "impact": {
                                "consumoFamiliar": -8,
                                "investimentoPrivado": -2.5,
                                "nivelPrecos": 0.05,
                                "score_factor": 1.025
                            },
                            "resultText": "A importação resolveu o problema de preços no curto prazo, mas prejudicou gravemente a recuperação dos produtores locais e piorou a balança comercial. A crise agrícola causou desemprego rural e migração para as cidades."
                        },
                        {
                            "combo": [
                                "b1",
                                "g2"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "taxaDeJuros": 0.2,
                                "consumoFamiliar": -8,
                                "investimentoPrivado": -2.5,
                                "nivelPrecos": -0.05,
                                "score_factor": 0.85
                            },
                            "resultText": "A inflação de alimentos foi controlada pela importação e pelo aperto monetário, mas o custo foi uma contração significativa no consumo e na atividade econômica geral."
                        },
                        {
                            "combo": [
                                "b2",
                                "g1"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "gastosPublicos": 20,
                                "consumoFamiliar": -5,
                                "investimentoPrivado": -3,
                                "nivelPrecos": 0.08,
                                "score_factor": 0.9
                            },
                            "resultText": "O forte apoio aos produtores rurais ajudou a mitigar a crise, mas a política monetária frouxa gerou inflação de alimentos. O consumo urbano foi impactado pelos preços altos e pela incerteza econômica."
                        }
                    ]
                },
                {
                    "asset": "/localEvents/jundiai/turismoAlta.png",
                    "name": "Boom Inesperado no Turismo",
                    "conditions": [],
                    "description": "O setor de turismo de Jundiaí está experimentando um crescimento extraordinário devido a campanhas de marketing bem-sucedidas, melhorias na infraestrutura local e maior interesse em destinos nacionais. Hotéis registram alta ocupação, restaurantes e comércios locais reportam aumento significativo nas vendas, e o setor de serviços como um todo se beneficia do influxo de visitantes.",
                    "impacts": {
                        "consumoFamiliar": 10,
                        "investimentoPrivado": 4
                    },
                    "options": {
                        "banco": [
                            {
                                "id": "b1",
                                "description": "Acumular reservas cambiais para mitigar a valorização excessiva da moeda."
                            },
                            {
                                "id": "b2",
                                "description": "Permitir a valorização natural da moeda, barateando importações."
                            }
                        ],
                        "governo": [
                            {
                                "id": "g1",
                                "description": "Investir em infraestrutura turística para sustentar o crescimento do setor."
                            },
                            {
                                "id": "g2",
                                "description": "Aumentar impostos sobre o setor de turismo para controlar o boom e arrecadar."
                            }
                        ]
                    },
                    "outcomes": [
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.7,
                            "impact": {
                                "gastosPublicos": 15,
                                "consumoFamiliar": 5,
                                "score_factor": 1.2
                            },
                            "resultText": "A acumulação de reservas evitou a 'doença holandesa' e os investimentos em infraestrutura qualificaram ainda mais o turismo. O setor continuou a crescer de forma robusta e sustentável."
                        },
                        {
                            "combo": [
                                "b1",
                                "g1"
                            ],
                            "chance": 0.3,
                            "impact": {
                                "gastosPublicos": 15,
                                "investimentoPrivado": 3.5,
                                "score_factor": 1.1
                            },
                            "resultText": "Os investimentos em infraestrutura foram positivos, mas a manutenção artificial da taxa de câmbio para proteger o turismo prejudicou levemente a competitividade de outros setores exportadores."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.4,
                            "impact": {
                                "gastosPublicos": 10,
                                "consumoFamiliar": 2,
                                "score_factor": 0.9750000000000001
                            },
                            "resultText": "A valorização da moeda e o aumento de impostos frearam o ímpeto do turismo. Embora a arrecadação tenha aumentado e as importações ficado mais baratas, o setor perdeu competitividade."
                        },
                        {
                            "combo": [
                                "b2",
                                "g2"
                            ],
                            "chance": 0.6,
                            "impact": {
                                "gastosPublicos": 8,
                                "investimentoPrivado": 3,
                                "nivelPrecos": -0.05,
                                "score_factor": 0.9750000000000001
                            },
                            "resultText": "A valorização cambial ajudou a controlar a inflação e os novos impostos geraram receita, mas o crescimento do turismo foi moderado. O governo conseguiu equilibrar os benefícios com a necessidade de controle."
                        },
                        {
                            "combo": [
                                "b1",
                                "g2"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "gastosPublicos": 12,
                                "consumoFamiliar": 3.8,
                                "score_factor": 1.1
                            },
                            "resultText": "O Banco Central conseguiu manter o câmbio estável, enquanto o governo aumentou a arrecadação com o setor. O boom foi controlado, gerando receita fiscal senza matar a galinha dos ovos de ouro, mas o crescimento foi menor que o potencial máximo."
                        },
                        {
                            "combo": [
                                "b2",
                                "g1"
                            ],
                            "chance": 1.0,
                            "impact": {
                                "gastosPublicos": 18,
                                "investimentoPrivado": 4.2,
                                "score_factor": 1.15
                            },
                            "resultText": "A moeda forte barateou insumos para a infraestrutura turística e outros setores. O turismo continuou forte, apesar do câmbio, devido aos investimentos que melhoraram a qualidade dos serviços."
                        }
                    ]
                }
            ]
        }
    ],
    "globalEvents": [
        {
            "asset": "/globalEvents/criseFinanceira.png",
            "name": "Crise Financeira Internacional",
            "goodEvent": false,
            "description": "Uma crise bancária em grandes economias gerou pânico nos mercados e fuga de capitais de países emergentes.",
            "impact": {
                "investimentoPrivado": -20,
                "taxaDeJuros": 0.1,
                "demandaMoeda": -3,
                "score_factor": 0.8
            }
        },
        {
            "asset": "/globalEvents/boomCommodities.png",
            "name": "Boom de Commodities",
            "goodEvent": true,
            "description": "O preço internacional de alimentos e minérios disparou, beneficiando países exportadores.",
            "impact": {
                "nivelPrecos": 0.1,
                "score_factor": 1.1
            }
        },
        {
            "asset": "/globalEvents/altaPetroleo.png",
            "name": "Alta Global no Petróleo",
            "goodEvent": false,
            "description": "O aumento nos preços do petróleo pressionou os custos de transporte e energia no mundo todo.",
            "impact": {
                "nivelPrecos": 0.25,
                "consumoFamiliar": -10,
                "score_factor": 0.85
            }
        },
        {
            "asset": "/globalEvents/estabilidadeGlobal.png",
            "name": "Estabilidade Econômica Global",
            "goodEvent": true,
            "description": "Confiança nos mercados e crescimento moderado trouxeram estabilidade e otimismo global.",
            "impact": {
                "investimentoPrivado": 10,
                "consumoFamiliar": 5,
                "score_factor": 1.15
            }
        },
        {
            "asset": "/globalEvents/livreComercio.png",
            "name": "Acordo Global de Livre Comércio",
            "goodEvent": true,
            "description": "Novos tratados internacionais reduziram barreiras comerciais, aumentando o fluxo de bens e serviços.",
            "impact": {
                "investimentoPrivado": 5,
                "score_factor": 1.05
            }
        },
        {
            "asset": "/globalEvents/choqueClimatico.png",
            "name": "Choque Climático Global",
            "goodEvent": false,
            "description": "Eventos climáticos extremos em vários países afetam a produção agrícola e pressionam preços.",
            "impact": {
                "nivelPrecos": 0.2,
                "consumoFamiliar": -5,
                "score_factor": 0.9
            }
        }
    ]
}